source/Enums/VKRQueueStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>VKRQueueStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Prepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Retry</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unknown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

source/CommonModules/VKRMail/Ext/Module.bsl
// Реальный SMTP-транспорт для локального учебного стенда Mailpit.
// Успех означает подтверждённый приём SMTP-сервером, а не прочтение письма.

Функция ПараметрыСоединения(Уведомление = Неопределено) Экспорт
    Ссылка = Константы.VKRSMTPProfile.Получить();
    Если Уведомление <> Неопределено Тогда
        Если ЗначениеЗаполнено(Уведомление.VKRSMTPProfile) Тогда
            Ссылка = Уведомление.VKRSMTPProfile;
        КонецЕсли;
    КонецЕсли;
    Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
        ВызватьИсключение "Не выбран почтовый профиль VKRSMTPProfile.";
    КонецЕсли;
    Профиль = Ссылка.ПолучитьОбъект();
    Если Профиль.ПометкаУдаления Тогда
        ВызватьИсключение "Почтовый профиль помечен на удаление.";
    КонецЕсли;
    Сервер = СокрЛП(Профиль.Server);
    Если Сервер <> "127.0.0.1" И Сервер <> "localhost" Тогда
        ВызватьИсключение "Эта сборка использует локальный SMTP-приёмник на 127.0.0.1.";
    КонецЕсли;
    Если Профиль.Port < 1 Или Профиль.Port > 65535 Тогда
        ВызватьИсключение "Порт SMTP должен быть от 1 до 65535.";
    КонецЕсли;
    Если НЕ ПустаяСтрока(Профиль.Login) Тогда
        ВызватьИсключение "Для локального профиля Mailpit оставьте логин пустым.";
    КонецЕсли;
    Отправитель = VKRRules.НормализоватьEmail(Профиль.EmailOtpravitelya);
    Возврат Новый Структура("Сервер,Порт,Отправитель", Сервер, Профиль.Port, Отправитель);
КонецФункции

Функция Отправить(Задание) Экспорт
    Р = Новый Структура("Состояние,Ошибка", Перечисления.VKRQueueStates.Failed, "");
    Попытка
        П = ПараметрыСоединения(Задание);
        Адрес = VKRRules.НормализоватьEmail(Задание.Email);
        Если ПустаяСтрока(Задание.TemaPisma) Или ПустаяСтрока(Задание.TekstPisma) Тогда
            ВызватьИсключение "В задании отсутствуют тема или текст.";
        КонецЕсли;
        Если СтрНайти(Задание.TemaPisma, Символы.ПС) > 0
            Или СтрНайти(Задание.TemaPisma, Символы.ВК) > 0 Тогда
            ВызватьИсключение "В теме письма обнаружен перевод строки.";
        КонецЕсли;
    Исключение
        Р.Ошибка = ОписаниеОшибки();
        Возврат Р;
    КонецПопытки;
    Профиль = Новый ИнтернетПочтовыйПрофиль;
    Профиль.АдресСервераSMTP = П.Сервер;
    Профиль.ПортSMTP = П.Порт;
    Профиль.Таймаут = 10;
    Профиль.ИспользоватьSSLSMTP = Ложь;
    Письмо = Новый ИнтернетПочтовоеСообщение;
    Письмо.Получатели.Добавить(Адрес);
    Письмо.Отправитель.Адрес = П.Отправитель;
    Письмо.Тема = Задание.TemaPisma;
    Письмо.Тексты.Добавить(Задание.TekstPisma);
    Почта = Новый ИнтернетПочта;
    Попытка
        Почта.Подключиться(Профиль);
    Исключение
        // Передача ещё не начиналась: повтор после отказа соединения допустим.
        Р.Состояние = Перечисления.VKRQueueStates.Retry;
        Р.Ошибка = ОписаниеОшибки();
        Возврат Р;
    КонецПопытки;
    Попытка
        Почта.Послать(Письмо);
        Р.Состояние = Перечисления.VKRQueueStates.Sent;
    Исключение
        // API может не дать достоверно определить, успел ли сервер принять письмо.
        Р.Состояние = Перечисления.VKRQueueStates.Unknown;
        Р.Ошибка = ОписаниеОшибки();
    КонецПопытки;
    Попытка
        Почта.Отключиться();
    Исключение
        // Ошибка закрытия не отменяет уже полученного подтверждения отправки.
        ЗаписьЖурналаРегистрации("VKR.ЗакрытиеSMTP", УровеньЖурналаРегистрации.Предупреждение,
            , , ОписаниеОшибки());
    КонецПопытки;
    Возврат Р;
КонецФункции
